import { Component } from '@angular/core';


@Component({
  selector: 'app-they-say-about-us',
  templateUrl: './they-say-about-us.component.html',
  styleUrls: ['./they-say-about-us.component.css']
})
export class TheySayAboutUsComponent {
  displayedIndexes: number[] = [];
  cards = [
    { id: 1, title: "לורם איפסום דולור סיט אמט, קונסקטורר אדיפיסינג אלית קולהע צופעט למרקוח איבן איף, ברומץ כלרשט מיחוצים. קלאצי סחטיר בלובק.  תצטנפל בלינדו למרקל אס לכימפו, דול,  צוט ומעיוט - לפתיעם ברשג - ולתיעם גדדיש.  קוויז דומור ליאמום בלינך רוגצה. לפמעט מוסן.צוט ומעיוט - לפתיעם ברשג - ולתיעם גדדיש.קוויז דומור ליאמום בלינך רוגצה. לפמעט מוסן.צוט ומעיוט - לפתיעם ברשג - ולתיעם גדדיש. קוויז דומור ליאמום בלינך רוגצה. לפמעט מוסן",name:"ישראל ישראלי" },
    { id: 2, title: "לורם איפסום דולור סיט אמט, קונסקטורר אדיפיסינג אלית קולהע צופעט למרקוח איבן איף, ברומץ כלרשט מיחוצים. קלאצי סחטיר בלובק.  תצטנפל בלינדו למרקל אס לכימפו, דול,  צוט ומעיוט - לפתיעם ברשג - ולתיעם גדדיש.  קוויז דומור ליאמום בלינך רוגצה. לפמעט מוסן.צוט ומעיוט - לפתיעם ברשג - ולתיעם גדדיש.קוויז דומור ליאמום בלינך רוגצה. לפמעט מוסן.צוט ומעיוט - לפתיעם ברשג - ולתיעם גדדיש. קוויז דומור ליאמום בלינך רוגצה. לפמעט מוסן",name:"ישראל ישראלי" },
    { id: 3, title: "לורם איפסום דולור סיט אמט, קונסקטורר אדיפיסינג אלית קולהע צופעט למרקוח איבן איף, ברומץ כלרשט מיחוצים. קלאצי סחטיר בלובק.  תצטנפל בלינדו למרקל אס לכימפו, דול,  צוט ומעיוט - לפתיעם ברשג - ולתיעם גדדיש.  קוויז דומור ליאמום בלינך רוגצה. לפמעט מוסן.צוט ומעיוט - לפתיעם ברשג - ולתיעם גדדיש.קוויז דומור ליאמום בלינך רוגצה. לפמעט מוסן.צוט ומעיוט - לפתיעם ברשג - ולתיעם גדדיש. קוויז דומור ליאמום בלינך רוגצה. לפמעט מוסן",name:"ישראל ישראלי"},
    { id: 4, title: "לורם איפסום דולור סיט אמט, קונסקטורר אדיפיסינג אלית קולהע צופעט למרקוח איבן איף, ברומץ כלרשט מיחוצים. קלאצי סחטיר בלובק.  תצטנפל בלינדו למרקל אס לכימפו, דול,  צוט ומעיוט - לפתיעם ברשג - ולתיעם גדדיש.  קוויז דומור ליאמום בלינך רוגצה. לפמעט מוסן.צוט ומעיוט - לפתיעם ברשג - ולתיעם גדדיש.קוויז דומור ליאמום בלינך רוגצה. לפמעט מוסן.צוט ומעיוט - לפתיעם ברשג - ולתיעם גדדיש. קוויז דומור ליאמום בלינך רוגצה. לפמעט מוסן",name:"ישראל ישראלי" },
    { id: 5, title: "לורם איפסום דולור סיט אמט, קונסקטורר אדיפיסינג אלית קולהע צופעט למרקוח איבן איף, ברומץ כלרשט מיחוצים. קלאצי סחטיר בלובק.  תצטנפל בלינדו למרקל אס לכימפו, דול,  צוט ומעיוט - לפתיעם ברשג - ולתיעם גדדיש.  קוויז דומור ליאמום בלינך רוגצה. לפמעט מוסן.צוט ומעיוט - לפתיעם ברשג - ולתיעם גדדיש.קוויז דומור ליאמום בלינך רוגצה. לפמעט מוסן.צוט ומעיוט - לפתיעם ברשג - ולתיעם גדדיש. קוויז דומור ליאמום בלינך רוגצה. לפמעט מוסן",name:"ישראל ישראלי" },
    { id: 6, title: "לורם איפסום דולור סיט אמט, קונסקטורר אדיפיסינג אלית קולהע צופעט למרקוח איבן איף, ברומץ כלרשט מיחוצים. קלאצי סחטיר בלובק.  תצטנפל בלינדו למרקל אס לכימפו, דול,  צוט ומעיוט - לפתיעם ברשג - ולתיעם גדדיש.  קוויז דומור ליאמום בלינך רוגצה. לפמעט מוסן.צוט ומעיוט - לפתיעם ברשג - ולתיעם גדדיש.קוויז דומור ליאמום בלינך רוגצה. לפמעט מוסן.צוט ומעיוט - לפתיעם ברשג - ולתיעם גדדיש. קוויז דומור ליאמום בלינך רוגצה. לפמעט מוסן",name:"ישראל ישראלי" },
    { id: 7, title: "לורם איפסום דולור סיט אמט, קונסקטורר אדיפיסינג אלית קולהע צופעט למרקוח איבן איף, ברומץ כלרשט מיחוצים. קלאצי סחטיר בלובק.  תצטנפל בלינדו למרקל אס לכימפו, דול,  צוט ומעיוט - לפתיעם ברשג - ולתיעם גדדיש.  קוויז דומור ליאמום בלינך רוגצה. לפמעט מוסן.צוט ומעיוט - לפתיעם ברשג - ולתיעם גדדיש.קוויז דומור ליאמום בלינך רוגצה. לפמעט מוסן.צוט ומעיוט - לפתיעם ברשג - ולתיעם גדדיש. קוויז דומור ליאמום בלינך רוגצה. לפמעט מוסן",name:"ישראל ישראלי" },
  ];

  displayedCards: { id: number, title: string, name: string }[] = [];
  currentIndex = 0;
  intervalId: any;

  ngOnInit() {
    this.showNextCards(true);
  }

  showNextCards(automatic: boolean) {
    const startIndex = this.currentIndex;
    this.displayedCards = this.cards.slice(startIndex, startIndex + 3);
    this.displayedIndexes = [startIndex, startIndex + 1, startIndex + 2];
  
    if (automatic) {
      this.intervalId = setTimeout(() => {
        this.currentIndex += 3;
        if (this.currentIndex >= this.cards.length) {
          this.currentIndex = 0;
        }
        this.showNextCards(true);
      }, 3000); // גלילה אוטומטית כל 3 שניות
    }
  }
  stopAutoScroll() {
    if (this.intervalId) {
      clearInterval(this.intervalId);
      this.intervalId = null;
    }
  }
  prevCards() {
    this.stopAutoScroll();
    this.currentIndex -= 3;
    if (this.currentIndex < 0) {
      this.currentIndex = this.cards.length - 3;
    }
    this.showNextCards(false);
  }
  nextCards() {
    this.stopAutoScroll();
    this.currentIndex += 3;
    if (this.currentIndex >= this.cards.length) {
      this.currentIndex = 0;
    }
    this.showNextCards(false);
  }
  goToCard(index: number) {
    this.stopAutoScroll();
    this.currentIndex = index;
    this.showNextCards(false);
  }
  
}